InformationRegisters/ПодпискиНаБизнесСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПодпискиНаБизнесСобытия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПотребителиБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеОбработчикиБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУведомлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НастройкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.СобытияУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУведомления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПотребителиБизнесСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПотребителиБизнесСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвтоматическийЗапускБизнесПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскаяОбработкаСобытий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассылкаУведомлений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПодпискиНаБизнесСобытия/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьЭлементСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЭлементСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлементСписка(Элемент)
	
	Если Элемент.ТекущиеДанные.Потребитель = ПредопределенноеЗначение("Перечисление.ПотребителиБизнесСобытий.ПользовательскаяОбработкаСобытий") Тогда
		
		ПараметрыФормы = Новый Структура("ВидСобытия, ВызовИзФормыПодписок", Элемент.ТекущиеДанные.ВидСобытия, Истина);
		ОткрытьФорму("РегистрСведений.СвязьПользовательскихОбработчиковБизнесСобытийИВидаСобытий.Форма.ФормаСпискаДляВидаСобытия", ПараметрыФормы);
		
	ИначеЕсли Элемент.ТекущиеДанные.Потребитель = ПредопределенноеЗначение("Перечисление.ПотребителиБизнесСобытий.АвтоматическийЗапускБизнесПроцессов") Тогда
		
		ПараметрыФормы = Новый Структура("ВидСобытия", Элемент.ТекущиеДанные.ВидСобытия);
		ОткрытьФорму(
			"РегистрСведений.ПравилаАвтоматическогоЗапускаБизнесПроцессов.Форма.ФормаСпискаУниверсальнаяДляВидаСобытия", 
			ПараметрыФормы);
		
	ИначеЕсли Элемент.ТекущиеДанные.Потребитель = ПредопределенноеЗначение("Перечисление.ПотребителиБизнесСобытий.РассылкаУведомлений") Тогда
		
		ПараметрыФормы = Новый Структура("ВидСобытия", Элемент.ТекущиеДанные.ВидСобытия);
		ОткрытьФорму("РегистрСведений.НастройкиУведомлений.Форма.ПодпискиНаУведомления", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры
